src/boundaryConditions/dynContactAngleModel/robinBC/test_00000_case/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    right
    {
        type            zeroGradient;//fixedValue;
	//value		uniform (-10 0 0);
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            zeroGradient;
    }

    left
    {
        type            zeroGradient;
    }
    
    bottomEmptyFaces
    {
    	type	empty;
    }
    
    topEmptyFaces
    {
    	type	empty;
    }
}


// ************************************************************************* //
