src/boundaryConditions/dynContactAngleModel/robinBC/test_00000_case/0.org/alpha.water_glycerol
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    right
    {
        type    zeroGradient;
        
    }
    bottom
    {
        //type    zeroGradient;
       type            robinBC;
        value           uniform 0;
        theta0      60;             // Not used by boundary condition
        limit           none; 
    }

    top
    {
        type    zeroGradient;
    }

    left
    {
        type    zeroGradient;
    }
    
    bottomEmptyFaces
    {
    	type	empty;
    }
    
    topEmptyFaces
    {
    	type	empty;
    }
}

// ************************************************************************* //
