src/boundaryConditions/dynContactAngleModel/robinBC/test_00000_case/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    right
    {
//        type    fixedValue;//For walls both are equivalent
//	value uniform 0;
        type    fixedFluxPressure;
        value   uniform 0; 
    }
    bottom
    {
        type    fixedFluxPressure;
        value   uniform 0; 
    }

    top
    {
        type    fixedFluxPressure;
        value   uniform 0; 
    }

    left
    {
        type    fixedFluxPressure;
        value   uniform 0; 
    }
    
    bottomEmptyFaces
    {
    	type	empty;
    }
    
    topEmptyFaces
    {
    	type	empty;
    }
}

// ************************************************************************* //
