src/boundaryConditions/dynContactAngleModel/robinBC/test_00000_case/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

rm -rf 0 && cp -r 0.org 0
runApplication cartesian2DMesh
runApplication checkMesh
rotateMesh "(0 1 0)" "(0 0 1)"

runApplication setAlphaField
runApplication interFlow
#------------------------------------------------------------------------------
